// Задание 1
// Создать переменные num1, num2 которые пользователь вводит с клавиатуры
// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.

// Задание 2
// Перепишите код к тернарному оператору

// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }
// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. 
// Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
// Задание 4
// Необязательное задание. (Если вам показалось домашнее задание простым, выполняем данный пункт)
// (Для решения задания вам потребуется оператор остаток от деления %, 
// например 10%3 === 1 , десять разделить на 3, остаток 1, 
// второй пример 7 % 5, тут остаток от деления будет 2, 
// ну и 3 пример это 14 % 10 === 4, остаток от деления на 10 будет равен 4)

// Необходимо от пользователя получить число.
// Необходимо вывести разряды числа, а именно: количество сотен, десятков и единиц.

// 1
const num1 = +prompt("Enter 1st number")
const num2 = +prompt("Enter 2nd number")
console.log(`Task 1: ${num1 <= 1 && num2 >= 3 ? true : false}`)

// 2
let test = true;
console.log(`Task 2: ${test===true ? '+++':'---'}`)

// 3
const day = +prompt('Введите число')
if (day >= 1 && day <= 10) {
    console.log(`Task 3: ${'Первая декада'}`)
} else if (day >= 11 && day <= 20) {
    console.log(`Task 3: ${'Вторая декада'}`)
} else if (day >= 21 && day <= 31) {
    console.log(`Task 3: ${'Третья декада'}`)
} else alert('Число должно быть в диапазоне от 1 до 31')

// 4
const num = +prompt("Введите число")
const units = num % 10
const decades = Math.floor(num / 10) % 10
const hundreds = Math.floor(num / 100)
console.log(`Task 4: В числе ${num} количество сотен: ${hundreds}, десятков: ${decades}, единиц: ${units}`)